In [1]:
import pandas as pd

In [2]:
dataset = pd.read_csv(r'../data/Air quality 2021.csv')
dataset.head()

,station,date,PM 2.5,PM 10,TSP,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13,Unnamed: 14,Unnamed: 15,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19
0,Bhimdatta,1/1/2021,108.76,153.01,218.05,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Bhimdatta,1/2/2021,86.04,141.10,196.07,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Bhimdatta,1/3/2021,143.80,202.20,231.40,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Bhimdatta,1/4/2021,143.80,202.20,231.40,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Bhimdatta,1/5/2021,97.80,142.74,196.39,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [5]:
dataset = dataset.drop(columns=["Unnamed: 5","Unnamed: 6", "Unnamed: 7","Unnamed: 8","Unnamed: 9", "Unnamed: 10","Unnamed: 11","Unnamed: 12", "Unnamed: 13","Unnamed: 14","Unnamed: 15", "Unnamed: 16","Unnamed: 17","Unnamed: 18", "Unnamed: 19"])
dataset.head()

     station      date  PM 2.5   PM 10     TSP
0  Bhimdatta  1/1/2021  108.76  153.01  218.05
1  Bhimdatta  1/2/2021   86.04  141.10  196.07
2  Bhimdatta  1/3/2021  143.80  202.20  231.40
3  Bhimdatta  1/4/2021  143.80  202.20  231.40
4  Bhimdatta  1/5/2021   97.80  142.74  196.39

In [7]:
dataset.shape

(4017, 5)

In [8]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4017 entries, 0 to 4016
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   station  4017 non-null   object
 1   date     4017 non-null   object
 2   PM 2.5   3975 non-null   float64
 3   PM 10    3903 non-null   float64
 4   TSP      3897 non-null   float64
dtypes: float64(3), object(2)
memory usage: 157.0+ KB